---
kind: method
id: M:Autodesk.Revit.DB.InstanceBinding.#ctor
source: html/96efe3f0-7449-099e-78f3-7017d5cfd4a9.htm
---
# Autodesk.Revit.DB.InstanceBinding.#ctor Method

Constructs an empty instance binding.

## Syntax (C#)
```csharp
public InstanceBinding()
```

## Remarks
Categories can be set a later time by using the Categories property of this object.